app/controllers/class_sessions_controller.rb

SELECT * FROM "class_sessions" WHERE (class_sessions.course_type_id = 1)
SELECT * FROM "class_sessions" ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def index
    util = Utility.new
    @day = util.day_hash
    @time = util.time_hash.invert

    @search = ClassSession.search(params[:search])
    @class_sessions = @search.all.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'

SELECT * FROM "class_sessions" WHERE ("class_sessions"."id" = 1)
---
  def show
    util = Utility.new
    @day = util.day_hash
    @time = util.time_hash.invert

    @class_session = ClassSession.find(params[:id])

SELECT * FROM "class_sessions" WHERE ("class_sessions"."id" = 1)
---
  def edit
    util = Utility.new
    @day = util.day_hash
    @time = util.time_hash

    @class_session = ClassSession.find(params[:id])

INSERT INTO "class_sessions" ("created_at", "updated_at", "class_session_name", "day", "start", "course_type_id") VALUES('2009-10-16 02:02:59', '2009-10-16 02:02:59', '12', 'senin', '12.00', 3)
---
  def create
    @class_session = ClassSession.new(params[:class_session])

    respond_to do |format|
      if @class_session.save

SELECT * FROM "class_sessions" WHERE ("class_sessions"."id" = 1)
UPDATE "class_sessions" SET "updated_at" = '2009-11-03 03:48:15', "class_session_name" = 'selasa', "day" = 'selasa' WHERE "id" = 2
---
  def update
    @class_session = ClassSession.find(params[:id])

    respond_to do |format|
      if @class_session.update_attributes(params[:class_session])

SELECT * FROM "class_sessions" WHERE ("class_sessions"."id" = 3)
DELETE FROM "class_sessions" WHERE "id" = 3
---
  def destroy
    @class_session = ClassSession.find(params[:id])
    @class_session.destroy