app/controllers/course_types_controller.rb

SELECT * FROM "course_types" ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def index
    @course_types = CourseType.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'

SELECT * FROM "course_types" WHERE ("course_types"."id" = 1)
---
  def show
    @course_type = CourseType.find(params[:id])

SELECT * FROM "course_types" WHERE ("course_types"."id" = 2)
---
  def edit
    @course_type = CourseType.find(params[:id])

INSERT INTO "course_types" ("created_at", "updated_at", "course_type_name", "course_type_fee") VALUES('2009-10-15 00:24:08', '2009-10-15 00:24:08', 'REGULER', 10000.0)
---
  def create
    @course_type = CourseType.new(params[:course_type])

    respond_to do |format|
      if @course_type.save

SELECT * FROM "course_types" WHERE ("course_types"."id" = 2)
UPDATE "course_types" SET "updated_at" = '2009-10-15 00:24:38', "course_type_fee" = 50000.0 WHERE "id" = 2
---
  def update
    @course_type = CourseType.find(params[:id])

    respond_to do |format|
      if @course_type.update_attributes(params[:course_type])