app/controllers/dashboard_controller.rb

  def index
    @active_student = Student.status_equals(true).count

    @today_students = StudentAttendance.student_attendance_date_equals(Date.today).paginate :page => params[:page], :per_page => 10, :order => 'id DESC'
    @today_tutors = TutorAttendance.attendance_day_equals(Date.today).paginate :page => params[:page], :per_page => 10, :order => 'id DESC'
---
SELECT count(*) AS count_all FROM "students" WHERE (students.status = 't')
SELECT * FROM "student_attendances" WHERE (student_attendances.student_attendance_date = '2009-10-18 20:46:49') ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT * FROM "students" WHERE (students.status IS NULL)
SELECT * FROM "tutor_attendances" WHERE (tutor_attendances.tutor_attendance_date = '2009-10-29') ORDER BY id DESC LIMIT 10 OFFSET 0