app/controllers/financial_reports_controller.rb

  def index
    @financial_reports = FinancialReport.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'
---
SELECT * FROM "financial_reports" WHERE ((financial_reports.value = 10.0) AND (financial_reports.transaction_type_id = 1))

  def show
    @financial_report = FinancialReport.find(params[:id])
---
SELECT * FROM "financial_reports" WHERE ("financial_reports"."id" = 1)

  def edit
    @financial_report = FinancialReport.find(params[:id])
---
SELECT * FROM "financial_reports" WHERE ("financial_reports"."id" = 7)

  def create
    @financial_report = FinancialReport.new(params[:financial_report])
    @financial_report.user_id = current_user.id
    @financial_report.debit = @financial_report.transaction_type.debit

    respond_to do |format|
      if @financial_report.save
---
INSERT INTO "financial_reports" ("transaction_type_id", "created_at", "updated_at", "financial_report_date", "value", "type", "user_id") VALUES(1, '2009-10-16 12:50:02', '2009-10-16 12:50:02', '2009-10-16', 1000.0, NULL, 1)

  def update
    @financial_report = FinancialReport.find(params[:id])
---
SELECT * FROM "financial_reports" WHERE ("financial_reports"."id" = 7)

  def destroy
    @financial_report = FinancialReport.find(params[:id])
    @financial_report.destroy
---
SELECT * FROM "financial_reports" WHERE ("financial_reports"."id" = 1)
DELETE FROM "financial_reports" WHERE "id" = 1