app/controllers/schedules_controller.rb

SELECT * FROM "class_sessions" WHERE ("class_sessions"."id" = 6)
---
  def details
    util = Utility.new
    @day = util.day_hash
    @time = util.time_hash.invert

    id = params[:id]
    @class_session = ClassSession.find(id)