app/controllers/schools_controller.rb

SELECT * FROM "schools" WHERE (schools.school_name LIKE '%SDN%')
SELECT * FROM "schools" ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def index
    @search = School.search(params[:search])
    @schools = @search.all.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'

SELECT * FROM "schools" WHERE ("schools"."id" = 1)
---
  def show
    @school = School.find(params[:id])

INSERT INTO "schools" ("created_at", "school_name", "updated_at", "school_no", "school_address") VALUES('2009-10-14 23:22:07', 'SDN Merdeka', '2009-10-14 23:22:07', 'Merdeka_1', '')
---
  def create
    @school = School.new(params[:school])

    respond_to do |format|
      if @school.save

SELECT * FROM "schools" WHERE ("schools"."id" = 1)
SELECT * FROM "students" WHERE (students.school_id = '1')
---
  def students
    @school = School.find(params[:id])
    @students = Student.school_id_equals(params[:id]).all.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'