app/controllers/students_controller.rb

  def index
    @active_student = Student.status_equals(true).count

    @student_6_count = Student.status_equals(true).grade_equals("6").count
    @student_5_count = Student.status_equals(true).grade_equals("5").count
    @student_4_count = Student.status_equals(true).grade_equals("4").count
    @student_3_count = Student.status_equals(true).grade_equals("3").count
    @student_2_count = Student.status_equals(true).grade_equals("2").count
    @student_1_count = Student.status_equals(true).grade_equals("1").count

    @search = Student.clean_search params[:search]
    @students = @search.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'
---
SELECT count(*) AS count_all FROM "students" WHERE ((students.grade = '6') AND (students.status = 't'))
SELECT * FROM "students" WHERE (((students.status = 'f') AND (students.register_date IS NULL)) AND (students.date_birth = '2009-10-10')) ORDER BY id DESC LIMIT 10 OFFSET 0

  def show
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 1)

  def edit
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 1)

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "place_birth", "address", "handphone_number", "grade", "created_at", "photo_file_size", "register_date", "date_birth", "updated_at", "photo_file_name", "photo_content_type", "father_name", "phone_number", "photo_updated_at", "student_no", "mother_name", "status", "school_id") VALUES('', '', '', '', '', '2009-10-15 00:52:53', NULL, '2009-10-15', '2009-10-15', '2009-10-15 00:52:53', NULL, NULL, '', '', NULL, 'dsds', '', 'f', 1)

  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])
---
SELECT * FROM "students" WHERE ("students"."id" = 1)
UPDATE "students" SET "updated_at" = '2009-10-15 00:58:18', "photo_file_name" = 'pic.jpg', "photo_file_size" = 7201, "photo_updated_at" = '2009-10-15 00:58:17', "photo_content_type" = 'image/jpeg' WHERE "id" = 2

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT * FROM "students" WHERE ("students"."id" = 1)
DELETE FROM "students" WHERE "id" = 1