app/controllers/student_payments_controller.rb

SELECT * FROM "student_payments"
---
  def index
    @search = StudentPayment.clean_search params[:search]
    @student_payments = @search.all.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'

SELECT * FROM "student_payments" WHERE ("student_payments"."id" = 1)
---
  def show
    @student_payment = StudentPayment.find(params[:id])

SELECT * FROM "student_payments" WHERE ("student_payments"."id" = 1)
---
  def edit
    @student_payment = StudentPayment.find(params[:id])

INSERT INTO "student_payments" ("student_id", "created_at", "updated_at", "month_payment") VALUES(4, '2009-10-28 05:08:19', '2009-10-28 05:08:19', '2009-10-28')
---
  def create
    @student_payment = StudentPayment.new(params[:student_payment])

    respond_to do |format|
      if @student_payment.save

SELECT * FROM "student_payments" WHERE ("student_payments"."id" = 1)
DELETE FROM "student_payments" WHERE "id" = 1
---
  def destroy
    @student_payment = StudentPayment.find(params[:id])
    @student_payment.destroy