app/controllers/student_grade_controller.rb

SELECT * FROM "students" WHERE (students.grade LIKE '%%') ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def index
    @grade = params[:id]
    @students = Student.grade_like(@grade).paginate :page => params[:page], :per_page => 10, :order => 'id DESC'