app/controllers/student_schedules_controller.rb

  def index
    @search = StudentSchedule.search params[:search]
---
SELECT * FROM "student_schedules"

  def show
    @student_schedule = StudentSchedule.find(params[:id])
---
SELECT * FROM "student_schedules" WHERE ("student_schedules"."id" = 1)

  def create
    @student_schedule = StudentSchedule.new(params[:student_schedule])

    respond_to do |format|
      if @student_schedule.save
---
INSERT INTO "student_schedules" ("student_id", "class_session_id", "created_at", "updated_at") VALUES(4, 4, '2009-11-03 14:32:20', '2009-11-03 14:32:20')