app/controllers/student_attendances_controller.rb

SELECT * FROM "student_attendances" WHERE (student_attendances.attendance = 'f')
---
  def index
    @search = StudentAttendance.clean_search params[:search]
    @student_attendances = @search.all.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'

SELECT * FROM "student_attendances" WHERE ("student_attendances"."id" = 1)
---
  def show
    @student_attendance = StudentAttendance.find(params[:id])

SELECT * FROM "student_attendances" WHERE ("student_attendances"."id" = 1)
---
  def edit
    @student_attendance = StudentAttendance.find(params[:id])

INSERT INTO "student_attendances" ("student_id", "class_session_id", "created_at", "student_attendance_date", "updated_at", "attendance") VALUES(5, 1, '2009-10-28 09:57:28', '2009-10-28', '2009-10-28 09:57:28', 't')
---
  def create
    @student_attendance = StudentAttendance.new(params[:student_attendance])

    respond_to do |format|
      if @student_attendance.save

SELECT * FROM "student_attendances" WHERE ("student_attendances"."id" = 1)
UPDATE "student_attendances" SET "updated_at" = '2009-10-28 09:56:17', "student_attendance_date" = '2009-10-28', "attendance" = 't' WHERE "id" = 1
---
  def update
    @student_attendance = StudentAttendance.find(params[:id])

    respond_to do |format|
      if @student_attendance.update_attributes(params[:student_attendance])