app/controllers/transaction_types_controller.rb

SELECT * FROM "transaction_types" WHERE (transaction_types.debit = 't') ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def index
    @search = TransactionType.search(params[:search])
    @transaction_types = @search.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'

SELECT * FROM "transaction_types" WHERE ("transaction_types"."id" = 1)
---
  def show
    @transaction_type = TransactionType.find(params[:id])

SELECT * FROM "transaction_types" WHERE ("transaction_types"."id" = 1)
---
  def edit
    @transaction_type = TransactionType.find(params[:id])

INSERT INTO "transaction_types" ("created_at", "updated_at", "transaction_type_name", "transaction_type_code", "type") VALUES('2009-10-16 12:46:04', '2009-10-16 12:46:04', 'asas', 'ADM', NULL)
---
  def create
    @transaction_type = TransactionType.new(params[:transaction_type])

    respond_to do |format|
      if @transaction_type.save

SELECT * FROM "transaction_types" WHERE ("transaction_types"."id" = 1)
UPDATE "transaction_types" SET "updated_at" = '2009-10-16 13:13:44', "debit" = 't' WHERE "id" = 1
---
  def update
    @transaction_type = TransactionType.find(params[:id])

    respond_to do |format|
      if @transaction_type.update_attributes(params[:transaction_type])