app/controllers/tutor_schedules_controller.rb

  def index
    @search = TutorSchedule.search params[:search]
    @tutor_schedules = @search.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'
---
SELECT * FROM "tutor_schedules"
SELECT * FROM "tutor_schedules" ORDER BY id DESC LIMIT 10 OFFSET 0

  def show
    @tutor_schedule = TutorSchedule.find(params[:id])
---
SELECT * FROM "tutor_schedules" WHERE ("tutor_schedules"."id" = 1)

  def create
    @tutor_schedule = TutorSchedule.new(params[:tutor_schedule])

    respond_to do |format|
      if @tutor_schedule.save
---
INSERT INTO "tutor_schedules" ("class_session_id", "created_at", "updated_at", "tutor_id") VALUES(4, '2009-11-03 13:27:48', '2009-11-03 13:27:48', 2)