app/controllers/tutor_attendances_controller.rb

SELECT * FROM "tutor_attendances" ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def index
    @search = TutorAttendance.clean_search params[:search]
    @tutor_attendances = @search.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'

SELECT * FROM "tutor_attendances" WHERE ("tutor_attendances"."id" = 1)
---
  def show
    @tutor_attendance = TutorAttendance.find(params[:id])

INSERT INTO "tutor_attendances" ("class_session_id", "created_at", "updated_at", "tutor_id", "tutor_attendance_date", "attendance") VALUES(1, '2009-10-28 10:28:11', '2009-10-28 10:28:11', 1, '2009-10-28', 't')
---
  def create
    @tutor_attendance = TutorAttendance.new(params[:tutor_attendance])

    respond_to do |format|
      if @tutor_attendance.save