app/controllers/tutors_controller.rb

SELECT * FROM "tutors" WHERE (tutors.tutor_name LIKE '%a%')
---
  def index
    @tutors = Tutor.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'

SELECT * FROM "tutors" WHERE ("tutors"."id" = 1)
---
  def show
    @tutor = Tutor.find(params[:id])

INSERT INTO "tutors" ("created_at", "tutor_name", "updated_at", "tutor_address", "tutor_handphone", "tutor_phone", "tutor_no") VALUES('2009-10-19 04:37:02', 'xc', '2009-10-19 04:37:02', 'xcx', 'xcx', 'xc', 'xc')
---
  def create
    @tutor = Tutor.new(params[:tutor])

    respond_to do |format|
      if @tutor.save