app/controllers/users_controller.rb

  def index
    @role = { 'admin' => 'Admin', 'cs' => 'Costumer Service' }
    @search = User.search(params[:search])
    @users = @search.all.paginate :page => params[:page], :per_page => 10, :order => 'id DESC'
---
SELECT * FROM "users" WHERE (users.role LIKE '%Costumer Service%')
SELECT * FROM "users" ORDER BY id DESC LIMIT 10 OFFSET 0

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "role", "password_salt", "persistence_token") VALUES('2009-12-25 01:26:37', '3b213f66e6231ca22d2def43adef4451d1c892720b4876d75c9f215c6cdd878bb354db7352d1b9cbfa5218660b2da8afbef89e3f86623d69be151783296bc731', '2009-12-25 01:26:37', 'test', 'operator', 'Rhd14n7I8Gl7OoVzFaq_', '748511e010bf1798001a451063824d1c6413305171061393847bbfd1a82f86fbca271e80a366359fe0b2fe990adef111a7a4e8b401024424b9ff943ff1ccbbf0')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2009-10-18 01:42:53', "role" = 'Admin' WHERE "id" = 1